g = [[1, 0, 0, 0, 0],
     [0, 1, 0, 1, 0],
     [0, 0, 1, 0, 1],
     [0, 1, 0, 1, 0],
     [0, 0, 1, 0, 1]]

g = [[1, 0, 0, 1, 0, 0, 0],
     [0, 1, 1, 0, 0, 0, 1],
     [0, 1, 1, 0, 0, 0, 1],
     [1, 0, 0, 1, 0, 0, 0],
     [0, 0, 0, 0, 1, 1, 0],
     [0, 0, 0, 0, 1, 1, 0],
     [0, 1, 1, 0, 0, 0, 1]]
n = len(g)
v = list(range(n))
v1 = list(range(1, n))
v_comp = []
while len(v) != 0:
    c = v[0]
    comp = {c}
    del v[0]
    for j in v:
        if g[c][j] > 0:
            comp.add(j)
            v1.remove(j)
    v_comp.append(comp)
    v = v1
print('Количество компонент связности: ', len(v_comp))
print('Компоненты:', v_comp)